import React from 'react'

class Body extends React.Component {
    render () {
        return (
            <div className="view-body">
                <p className="title">【江山美人】5月24日更新维护公告</p>
                <p className="time">2018-05-24 10:37:35</p>
                <div className="text">
                    <p className="bold">亲爱的各位大人：</p>
                    <p>为了给大家带来更好的游戏体验，游戏将于5月24日 11:30分进行更新，此次更新将不停服，但需要大家退出游戏重新登陆。非常抱歉给各位大人带来不便，特此准备了一份礼物，烦请查收；</p>
                    <p>为了给大家带来更好的游戏体验，游戏将于5月24日 11:30分进行更新，此次更新将不停服，但需要大家退出游戏重新登陆。非常抱歉给各位大人带来不便，特此准备了一份礼物，烦请查收；</p>
                    <p>为了给大家带来更好的游戏体验，游戏将于5月24日 11:30分进行更新，此次更新将不停服，但需要大家退出游戏重新登陆。非常抱歉给各位大人带来不便，特此准备了一份礼物，烦请查收；</p>
                    <p>更新结束后请各位在更新前已经登陆游戏的玩家，切记退出游戏重新登录。以免遇到部分素材、资源等无法刷出的异常，影响大家的体验。</p>
                    <p className="bold">1.新增副帮主可踢人功能；</p>
                    <p>2.皇宫相关机制修改： 取消掉点皇宫默认进后殿，改为前殿；当后续开启千古一帝玩法时，再默认进后殿；当开启跨服活动的时候，皇宫才出现后殿入口，否则后殿入口隐藏；</p>
                    <p className="bold">3.隐藏"江湖侠士"称号和冯小怜的皮肤，待功能上线后再开启；</p>
                    <p>4.修复跨服亲密活动排名显示问题；</p>
                    <p>5.优化惩戒女囚系列活动规则说明中加入对一键惩罚功能的相关说明；</p>
                </div>
            </div>
        )
    }
}

export default Body